In [1]:
import pandas as pd

In [2]:
people = {
    "first": ["Al", "Bhosdu", "Babblu"], 
    "last": ["Singh", "Lullu", "Capone"],
    "email": ["as@gmal.com", "bl@email.com", "bs@email.com"]
}

In [3]:
sample_df = pd.DataFrame(people)

In [5]:
sample_df["first"] + " " + sample_df["last"]

0         Al Singh
1     Bhosdu Lullu
2    Babblu Capone
dtype: object

In [6]:
# Combining columns
sample_df["full_name"] = sample_df["first"] + " " + sample_df["last"]

In [7]:
sample_df

    first    last         email      full_name
0      Al   Singh   as@gmal.com       Al Singh
1  Bhosdu   Lullu  bl@email.com   Bhosdu Lullu
2  Babblu  Capone  bs@email.com  Babblu Capone

In [10]:
# Removing columns
sample_df.drop(columns=["first", "last"], inplace=True)

In [11]:
sample_df

          email      full_name
0   as@gmal.com       Al Singh
1  bl@email.com   Bhosdu Lullu
2  bs@email.com  Babblu Capone

In [12]:
sample_df["full_name"].str.split(" ")

0         [Al, Singh]
1     [Bhosdu, Lullu]
2    [Babblu, Capone]
Name: full_name, dtype: object

In [14]:
sample_df["full_name"].str.split(" ", expand=True)

        0       1
0      Al   Singh
1  Bhosdu   Lullu
2  Babblu  Capone

In [15]:
sample_df[["first", "last"]] = sample_df["full_name"].str.split(" ", expand=True)

In [16]:
sample_df

          email      full_name   first    last
0   as@gmal.com       Al Singh      Al   Singh
1  bl@email.com   Bhosdu Lullu  Bhosdu   Lullu
2  bs@email.com  Babblu Capone  Babblu  Capone

In [25]:
# Add single row
sample_df = pd.concat([sample_df, pd.DataFrame.from_records([{"first": "Chaman"}])])

In [26]:
sample_df

          email      full_name   first    last
0   as@gmal.com       Al Singh      Al   Singh
1  bl@email.com   Bhosdu Lullu  Bhosdu   Lullu
2  bs@email.com  Babblu Capone  Babblu  Capone
0           NaN            NaN  Chaman     NaN